In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

### Merge and Concatenation

Consider artifical data, with dataframes df_a, df_b, df_n

In [3]:
raw_data = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}
df_a = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name'])


raw_data = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}
df_b = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name'])


raw_data = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}
df_n = pd.DataFrame(raw_data, columns = ['subject_id','test_id'])

print('Dataframe: df_a \n',df_a)
print('Dataframe: df_b \n',df_b)
print('Dataframe: df_n \n',df_n)

Dataframe: df_a
   subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
Dataframe: df_b
   subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan
Dataframe: df_n
   subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

#### Concatenation operation

In [4]:
#equivalent to union operation of SQL
df_new = pd.concat([df_a, df_b])
df_new

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [5]:
#concatenate column-wise
pd.concat([df_a, df_b], axis=1)

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson          4      Billy    Bonder
1          2        Amy  Ackerman          5      Brian     Black
2          3      Allen       Ali          6       Bran   Balwner
3          4      Alice      Aoni          7      Bryce     Brice
4          5     Ayoung   Atiches          8      Betty    Btisan

#### Merge two dataframes

In [6]:
#merge dataframes based on a common column
#similar to joins in SQL
pd.merge(df_new, df_n, on='subject_id')

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          4      Billy    Bonder       61
5          5     Ayoung   Atiches       16
6          5      Brian     Black       16
7          7      Bryce     Brice       14
8          8      Betty    Btisan       15

#### Creating new columns in a dataframe

We can create new columns for creating or extracting features.

In [7]:
#create new feature of full name
df_a['full_name'] = df_a['first_name'] +' ' + df_a['last_name']
df_a

  subject_id first_name last_name       full_name
0          1       Alex  Anderson   Alex Anderson
1          2        Amy  Ackerman    Amy Ackerman
2          3      Allen       Ali       Allen Ali
3          4      Alice      Aoni      Alice Aoni
4          5     Ayoung   Atiches  Ayoung Atiches

In [8]:
#inplace option helps you drop it entirely
df_a.drop(['full_name'], axis=1)

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [9]:
salary = np.random.randint(1000,100000,size = df_a.shape[0])
df_a['salary'] = salary
df_a

  subject_id first_name last_name       full_name  salary
0          1       Alex  Anderson   Alex Anderson   71227
1          2        Amy  Ackerman    Amy Ackerman   90755
2          3      Allen       Ali       Allen Ali   25267
3          4      Alice      Aoni      Alice Aoni    9787
4          5     Ayoung   Atiches  Ayoung Atiches    4583

In [10]:
yob = pd.Series(np.random.randint(1950, 2000,size = df_a.shape[0]))
df_a['yob'] = yob
df_a

  subject_id first_name last_name       full_name  salary   yob
0          1       Alex  Anderson   Alex Anderson   71227  1964
1          2        Amy  Ackerman    Amy Ackerman   90755  1992
2          3      Allen       Ali       Allen Ali   25267  1972
3          4      Alice      Aoni      Alice Aoni    9787  1978
4          5     Ayoung   Atiches  Ayoung Atiches    4583  1966

In [ ]:
import datetime
now = datetime.datetime.now()
df_a['age'] = now.year - df_a['yob']
df_a['age']

#### Group by operation

Useful operation while summarizing measures in our dataframes.

In [ ]:
df_a.groupby(['age'])['salary'].mean()

Performing on titanic dataset

In [ ]:
#read the dataset
df_titanic = pd.read_csv('../data/titanic.csv.bz2')
df_titanic.head()

In [ ]:
df_titanic.groupby(['pclass'])['fare'].mean()

In [ ]:
df_titanic.groupby(['pclass','embarked'])['embarked'].count()

In [ ]:
df_titanic.groupby(['embarked','home.dest'])['fare'].mean()